Importancion de la base de datos

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('airlines.csv')
df.head(10)

,Airline ID,Nombre,Alias,Asociacion_Internacional_Transporte_Aereo,Organizacion_Aviacion_Civil_Internacional,Callsign,Ciudad,Activo
0,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
1,10,40-Mile Air,\N,Q5,MLA,MILE-AIR,United States,Y
2,13,Ansett Australia,\N,AN,AAA,ANSETT,Australia,Y
3,15,Abelag Aviation,\N,W9,AAB,ABG,Belgium,N
4,21,Aigle Azur,\N,ZI,AAF,AIGLE AZUR,France,Y
5,22,Aloha Airlines,\N,AQ,AAH,ALOHA,United States,Y
6,24,American Airlines,\N,AA,AAL,AMERICAN,United States,Y
7,28,Asiana Airlines,\N,OZ,AAR,ASIANA,Republic of Korea,Y
8,29,Askari Aviation,\N,4K,AAS,AL-AAS,Pakistan,Y
9,32,Afriqiyah Airways,\N,8U,AAW,AFRIQIYAH,Libya,Y

Informacion General

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1010 entries, 0 to 1009
Data columns (total 8 columns):
 #   Column                                     Non-Null Count  Dtype
---  ------                                     --------------  -----
 0   Airline ID                                 1010 non-null   int64
 1   Nombre                                     1010 non-null   object
 2   Alias                                      1010 non-null   object
 3   Asociacion_Internacional_Transporte_Aereo  1010 non-null   object
 4   Organizacion_Aviacion_Civil_Internacional  1010 non-null   object
 5   Callsign                                   1010 non-null   object
 6   Ciudad                                     1010 non-null   object
 7   Activo                                     1010 non-null   object
dtypes: int64(1), object(7)
memory usage: 63.3+ KB

In [4]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Airline ID,1010.0,3540.049505,3846.666624,3.0,1365.5,2854.0,4326.5,21317.0

Buscar valores nulos

In [5]:
df.isnull().sum()

Airline ID                                   0
Nombre                                       0
Alias                                        0
Asociacion_Internacional_Transporte_Aereo    0
Organizacion_Aviacion_Civil_Internacional    0
Callsign                                     0
Ciudad                                       0
Activo                                       0
dtype: int64

In [6]:
(df.isnull().sum() / len(df)) * 100

Airline ID                                   0.0
Nombre                                       0.0
Alias                                        0.0
Asociacion_Internacional_Transporte_Aereo    0.0
Organizacion_Aviacion_Civil_Internacional    0.0
Callsign                                     0.0
Ciudad                                       0.0
Activo                                       0.0
dtype: float64

Eliminar duplicados

In [7]:
print("Duplicados Antes:", df.duplicated().sum())

df = df.drop_duplicates()

print("Duplicados Después:", df.duplicated().sum())

Duplicados Antes: 0
Duplicados Después: 0

Eliminar nulos

In [8]:
df = df.dropna()
df.isnull().sum()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1010 entries, 0 to 1009
Data columns (total 8 columns):
 #   Column                                     Non-Null Count  Dtype
---  ------                                     --------------  -----
 0   Airline ID                                 1010 non-null   int64
 1   Nombre                                     1010 non-null   object
 2   Alias                                      1010 non-null   object
 3   Asociacion_Internacional_Transporte_Aereo  1010 non-null   object
 4   Organizacion_Aviacion_Civil_Internacional  1010 non-null   object
 5   Callsign                                   1010 non-null   object
 6   Ciudad                                     1010 non-null   object
 7   Activo                                     1010 non-null   object
dtypes: int64(1), object(7)
memory usage: 63.3+ KB

In [9]:
df.rename(columns={"Airline ID": "ID",}, inplace=True)
df.head()

,ID,Nombre,Alias,Asociacion_Internacional_Transporte_Aereo,Organizacion_Aviacion_Civil_Internacional,Callsign,Ciudad,Activo
0,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
1,10,40-Mile Air,\N,Q5,MLA,MILE-AIR,United States,Y
2,13,Ansett Australia,\N,AN,AAA,ANSETT,Australia,Y
3,15,Abelag Aviation,\N,W9,AAB,ABG,Belgium,N
4,21,Aigle Azur,\N,ZI,AAF,AIGLE AZUR,France,Y

In [10]:
df.isnull().sum()

ID                                           0
Nombre                                       0
Alias                                        0
Asociacion_Internacional_Transporte_Aereo    0
Organizacion_Aviacion_Civil_Internacional    0
Callsign                                     0
Ciudad                                       0
Activo                                       0
dtype: int64